# Core bootstrap tools
base-devel
git
git-lfs
stow

# X11 + session
xorg-server
xorg-xinit
xorg-setxkbmap
xorg-xkbcomp
xorg-xrandr
xorg-xinput
xorg-xrdb
xorg-xset
xdotool
xbindkeys
i3-wm
alacritty
dmenu
polybar
rofi
dunst
gsimplecal
picom
xss-lock
feh
flameshot
lxqt-policykit
networkmanager
network-manager-applet

# Audio + desktop utilities
pulseaudio
pamixer
pavucontrol
pasystray
blueman
bluez-utils
libnotify
nemo
drawing
mousepad
gvfs
xdg-desktop-portal
xdg-desktop-portal-gtk
adw-gtk-theme

# Media playback
mpv
yt-dlp

# Script/runtime dependencies used by the repo
python
jq
yad
github-cli
curl
go
jdk17-openjdk
libcap
desktop-file-utils
hicolor-icon-theme

# Fonts used by desktop UI and polybar
noto-fonts
noto-fonts-emoji
ttf-dejavu
ttf-liberation
otf-font-awesome
ttf-nerd-fonts-symbols

# Desktop applications referenced by i3 bindings
telegram-desktop
element-desktop
libfdk-aac
obs-studio
steam
