# Core bootstrap tools
base-devel
git
git-lfs
stow

# X11 + session
xorg-server
xorg-xinit
xorg-setxkbmap
xorg-xkbcomp
xorg-xrandr
xorg-xinput
xorg-xset
xdotool
i3-wm
alacritty
dmenu
polybar
rofi
dunst
gsimplecal
picom
xss-lock
feh
flameshot
lxqt-policykit
networkmanager
network-manager-applet

# Audio + desktop utilities
pulseaudio
pamixer
pavucontrol
pasystray
blueman
libnotify

# Script/runtime dependencies used by the repo
python
jq
yad
github-cli

# Fonts used by polybar
otf-font-awesome
ttf-nerd-fonts-symbols

# Desktop applications referenced by i3 bindings
telegram-desktop
element-desktop
steam
